---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ColumnBaseAttachmentOffsetParam
source: html/f5e7a088-5f97-4e54-a6d6-dec4f3b80c58.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ColumnBaseAttachmentOffsetParam Property

"Offset From Attachment At Base"

## Syntax (C#)
```csharp
public static ForgeTypeId ColumnBaseAttachmentOffsetParam { get; }
```